 ![png](Books_Core_ERD.png)

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
from urllib.parse import quote_plus   # This import is needed if you have a
                                      # special character in your password.

username = "root"
password = quote_plus("ViperRT/10") # (whatever password you chose during mysql installation).
                                    # Using the quote function to make the password compatible
                                    # when it has special characters included.
db_name = "Books_CORE"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
#Connection engine between Python and MySQL
engine = create_engine(connection)

In [4]:
###CREATING DATABASE###

# Check if the database exists. If not, create it.
if database_exists(connection) == False:
    create_database(connection)
else:
    print('The database already exists')

In [5]:
#Additional verification of database creation
database_exists(connection)

True

# Making dataframe into MySQL table.

## Making AUTHORS table.

In [6]:
#1st:  Making Dataframe.
authors_df = pd.read_csv('CORE_authors.csv')
authors_df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [8]:
#2nd:  Convert dataframe to SQL table.
authors_df.to_sql('authors', engine, if_exists = 'replace')

5

In [14]:
#Confirming table by performing a database query.
q = """SELECT * FROM authors LIMIT 5;"""
pd.read_sql(q, engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

## Making BOOKS table.

In [9]:
#1st:  Making Dataframe.
books_df = pd.read_csv('CORE_books.csv')
books_df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [10]:
#2nd:  Convert dataframe to SQL table.
books_df.to_sql('books', engine, if_exists = 'replace')

6

In [13]:
#Confirming table by performing a database query.
q = """SELECT * FROM books LIMIT 5;"""
pd.read_sql(q, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4

## Making CUSTOMERS table.

In [15]:
#1st:  Making Dataframe.
customers_df = pd.read_csv('CORE_customers.csv')
customers_df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [16]:
#2nd:  Convert dataframe to SQL table.
customers_df.to_sql('customers', engine, if_exists = 'replace')

3

In [17]:
#Confirming table by performing a database query.
q = """SELECT * FROM customers LIMIT 5;"""
pd.read_sql(q, engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

## Making FAVORITE_BOOKS table.

In [18]:
#1st:  Making Dataframe.
favorite_books_df = pd.read_csv('CORE_favorites.csv')
favorite_books_df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [19]:
#2nd:  Convert dataframe to SQL table.
favorite_books_df.to_sql('favorite_books', engine, if_exists = 'replace')

7

In [20]:
#Confirming table by performing a database query.
q = """SELECT * FROM favorite_books LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

# SQL query to show all tables in database.

In [21]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books_core
0              authors
1                books
2            customers
3       favorite_books

# Testing Database
Listing the titles of all of John Doe's favorite books.

In [22]:
test_q = """SELECT books.title, favorite_books.user_id
            FROM books
            JOIN favorite_books ON books.id = favorite_books.book_id
            WHERE favorite_books.user_id = 
                (SELECT customers.id FROM customers WHERE (customers.last_name = "Doe" AND customers.first_name = "John"));"""
pd.read_sql(test_q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1